viteproject-backend/app/controllers/api/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "failed_attempts", "unlock_token", "locked_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
---
    def create
      Rails.logger.info "Sign up params received: #{params.inspect}"

      # パラメータを手動で受け取ってログ出力
      user_params = params.require(:user).permit(:email, :password, :password_confirmation)
      Rails.logger.info "Permitted user params: #{user_params.inspect}"

      user = User.new(user_params)

      if user.save