viteproject-backend/app/controllers/api/users_controller.rb

    def authenticate_user!
      token = request.headers['Authorization']&.sub(/^Bearer /, '') || ''
      if token.blank?
        return render json: { error: 'No token provided' }, status: :unauthorized
      end

      begin
        payload = JWT.decode(token, ENV['SECRET_KEY_BASE'] || Rails.application.credentials.secret_key_base, true, algorithm: 'HS256').first
        @current_user = User.find_by(id: payload['sub'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]